# Chapter 3: Data Wrangling

In [58]:
import pandas as pd
import numpy as np

## 3.0 Introduction

In [4]:
# url = 'https://tinyurl.com/titanic-csv'
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

In [5]:
df = pd.read_csv(url)

In [6]:
df.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

## 3.1 Creating a Data Frame

Create an empty DF and define each column separately:

In [7]:
df = pd.DataFrame()

In [8]:
df['Name'] = ['Jacky Jackson', 'Steven Stevenson']
df['Age'] = [38, 25]
df['Driver'] = [True, False]

In [9]:
df

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

Create and append a row:

In [10]:
newPerson = pd.Series(['Molly Mooney', 40, True], index=['Name', 'Age', 'Driver'])
df.append(newPerson, ignore_index=True)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False
2      Molly Mooney   40    True

Note: we did not assign this to the df so row was not added in-place.

## 3.2 Describing the Data

In [12]:
# url = 'https://tinyurl.com/titanic-csv'
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

In [13]:
df = pd.read_csv(url)

In [14]:
df.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [15]:
df.shape

(1313, 6)

In [16]:
df.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

## 3.3 Navigating DataFrames

In [17]:
# url = 'https://tinyurl.com/titanic-csv'
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

In [18]:
df = pd.read_csv(url)

In [19]:
df.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [20]:
df.iloc[:4]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [21]:
dfNI = df.set_index(df['Name'])

In [23]:
dfNI.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

## 3.4 Selecting Rows Based on Conditionals

In [24]:
# url = 'https://tinyurl.com/titanic-csv'
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

In [25]:
df = pd.read_csv(url)

Show top 2 rows where 'Sex' is 'female':

In [26]:
df[df['Sex'] == 'female'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

Female passengers 65 & older:

In [28]:
df[(df['Sex'] == 'female') & (df['Age'] >= 65)]

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

## 3.5 Replacing Values

In [17]:
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

In [18]:
df = pd.read_csv(url)

In [32]:
df['Sex'].replace("female", "Woman").head()

0    Woman
1    Woman
2     male
3    Woman
4     male
Name: Sex, dtype: object

Replace multiple values at the same time:

In [30]:
df['Sex'].replace(["female", "male"], ["Woman", "Man"]).head()

0    Woman
1    Woman
2      Man
3    Woman
4      Man
Name: Sex, dtype: object

Replace throughout entire DF:

In [31]:
df.replace(1, "One").head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29,female,One,One
1,"Allison, Miss Helen Loraine",1st,2,female,0,One
2,"Allison, Mr Hudson Joshua Creighton",1st,30,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25,female,0,One
4,"Allison, Master Hudson Trevor",1st,0.92,male,One,0

`.replace()` also accepts regex:

In [33]:
df.replace(r"1st", "First", regex=True).head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",First,29.00,female,1,1
1,"Allison, Miss Helen Loraine",First,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",First,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",First,25.00,female,0,1
4,"Allison, Master Hudson Trevor",First,0.92,male,1,0

## 3.6 Renaming Columns

`.rename()`

In [34]:
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

In [35]:
df = pd.read_csv(url)

In [37]:
df.rename(columns={'PClass': 'Passenger Class', 'Sex': 'Gender'}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

#### Create a dict with old column names as keys:

In [39]:
import collections

In [40]:
colNames = collections.defaultdict(str)

In [41]:
colNames

defaultdict(str, {})

In [42]:
for name in df.columns:
    colNames[name]

In [43]:
colNames

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

## 3.7 Finding the Minimum, Maximum, Sum, Average, and Count

In [44]:
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

In [45]:
df = pd.read_csv(url)

In [46]:
print('Maximum:', df['Age'].max())
print('Minimum:', df['Age'].min())
print('Mean:', df['Age'].mean())
print('Sum:', df['Age'].sum())
print('Count:', df['Age'].count())

Maximum: 71.0
Minimum: 0.17
Mean: 30.397989417989415
Sum: 22980.88
Count: 756

Can also apply to entire DF:

In [47]:
df.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

## 3.8 Finding Unique Values

In [44]:
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

In [45]:
df = pd.read_csv(url)

`.unique()`

In [48]:
df['Sex'].unique()

array(['female', 'male'], dtype=object)

In [49]:
df['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [51]:
df['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [52]:
df[df['PClass'] == '*']

                    Name PClass  Age   Sex  Survived  SexCode
456  Jacobsohn Mr Samuel      *  NaN  male         0        0

## 3.9 Handling Missing Values

In [44]:
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

In [45]:
df = pd.read_csv(url)

Select missing values:

In [53]:
df[df['Age'].isnull()].head()

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0
14            Baumann, Mr John D    1st  NaN    male         0        0
29       Borebank, Mr John James    1st  NaN    male         0        0
32            Bradley, Mr George    1st  NaN    male         1        0

Replace values with NaN:

In [55]:
# df['Sex'] = df['Sex'].replace('male', NaN)

In [57]:
import numpy as np

In [59]:
df['Sex'] = df['Sex'].replace('male', np.nan)

Specify missing values in `read_csv()` using `na_values=`:

In [60]:
df = pd.read_csv(url, na_values=[np.nan, 'NONE', -999])

## 3.10 Deleting a Column

In [61]:
df = pd.read_csv(url)

In [62]:
df.drop('Age', axis=1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

In [64]:
df.drop(['Age', 'Sex'], axis=1).head(2)

                           Name PClass  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st         1        1
1   Allison, Miss Helen Loraine    1st         0        1

Can also use the column index to drop:

In [65]:
df.drop(df.columns[1], axis=1).head(2)

                           Name   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  29.0  female         1        1
1   Allison, Miss Helen Loraine   2.0  female         0        1

Try to treat DFs as immutable objects:

In [66]:
dfNameDropped = df.drop(df.columns[0], axis=1)

## 3.11 Deleting a Row

In [67]:
df = pd.read_csv(url)

In [68]:
df[df['Sex'] != 'female'].head(2)

                                  Name PClass    Age   Sex  Survived  SexCode
2  Allison, Mr Hudson Joshua Creighton    1st  30.00  male         0        0
4        Allison, Master Hudson Trevor    1st   0.92  male         1        0

Delete rows using boolean conditions

In [71]:
df[df['Name'] != 'Allison, Miss Helen Loraine'].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [72]:
df[df.index != 0].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

## 3.12 Dropping Duplicate Rows

In [73]:
df = pd.read_csv(url)

In [74]:
len(df)

1313

In [75]:
df.drop_duplicates().head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [77]:
len(df.drop_duplicates())

1313

In [78]:
df.drop_duplicates(subset=['Sex'])

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [79]:
df.drop_duplicates(subset=['Sex'], keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

## 3.13 Grouping Rows by Values

In [80]:
df = pd.read_csv(url)

In [81]:
df.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [82]:
df.groupby('PClass').mean()

              Age  Survived   SexCode
PClass
*             NaN  0.000000  0.000000
1st     39.667788  0.599379  0.444099
2nd     28.300142  0.426523  0.383513
3rd     25.208585  0.194093  0.298172

#### Question: If we account for Gender, does the survivability gap between classes disappear?

In [83]:
df.groupby('Sex')

Group by rows, count rows:

In [85]:
df.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

Group by a first column, then group that grouping by a second column:

In [84]:
df.groupby(['Sex', 'Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

## 3.14 Grouping Rows by Time

In [93]:
np.random.seed(42)

`.resample()`

Create date range:

In [94]:
timeIndex = pd.date_range('06/06/2017', periods=100000, freq='30S')

Create DF:

In [95]:
df = pd.DataFrame(index=timeIndex)

Create column of random values:

In [96]:
df['SaleAmount'] = np.random.randint(1, 10, 100000)

Group rows by week, calculate sum per week:

In [97]:
df.resample('W').sum()

            SaleAmount
2017-06-11       86121
2017-06-18      101440
2017-06-25      101170
2017-07-02      100867
2017-07-09      100894
2017-07-16       10437

In [98]:
df.head(3)

                     SaleAmount
2017-06-06 00:00:00           7
2017-06-06 00:00:30           4
2017-06-06 00:01:00           8

Group by two weeks, calculate mean:

In [99]:
df.resample('2W').mean()

            SaleAmount
2017-06-11    4.983854
2017-06-25    5.025050
2017-07-09    5.003993
2017-07-23    5.017788

Group by month, count rows:

In [100]:
df.resample('M').count()

            SaleAmount
2017-06-30       72000
2017-07-31       28000

## 3.15 Looping Over a Column

In [101]:
df = pd.read_csv(url)

Print first two names uppercased:

In [102]:
for name in df['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

Can also use list comprehensions:

In [103]:
[name.upper() for name in df['Name'][0:2]]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

## 3.16 Applying a Function Over All Elements in a Column

`.apply()`

In [104]:
df = pd.read_csv(url)

In [105]:
def uppercase(x):
    return x.upper()

In [106]:
df['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

## 3.17 Applying a Function to Groups

`.groupby()` and `.apply()`

In [107]:
df = pd.read_csv(url)

In [108]:
df.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

## 3.18 Concatenating DataFrames

`.concat()`

In [109]:
dataA = {'id': ['1', '2', '3'],
        'first': ['Alex', 'Amy', 'Allen'],
        'last': ['Anderson', 'Ackerman', 'Ali']}
dfA = pd.DataFrame(dataA, columns = ['id', 'first', 'last'])

In [110]:
dataB = {'id': ['4', '5', '6'],
        'first': ['Billy', 'Brian', 'Bran'],
        'last': ['Bonder', 'Black', 'Balwner']}
dfB = pd.DataFrame(dataB, columns = ['id', 'first', 'last'])

In [111]:
pd.concat([dfA, dfB], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [112]:
pd.concat([dfA, dfB], axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

Use `.append()` to add a new row to a DF:

In [113]:
row = pd.Series([10, 'Chris', 'Chillon'], index=['id', 'first', 'last'])

In [114]:
dfA.append(row, ignore_index=True)

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
3  10  Chris   Chillon

## 3.19 Merging DataFrames

`.merge()`

In [116]:
employeeData = {'employeeID': ['1', '2', '3', '4'],
               'name': ['Amy Jones', 'Allen Keys', 'Alice Bees', 'Tim Horton']}
dfEmployees = pd.DataFrame(employeeData, columns = ['employeeID', 'name'])

In [117]:
salesData = {'employeeID': ['3', '4', '5', '6'],
            'totalSales': [23456, 2512, 2345, 1455]}
dfSales = pd.DataFrame(salesData, columns = ['employeeID', 'totalSales'])

In [118]:
pd.merge(dfEmployees, dfSales, on='employeeID')

  employeeID        name  totalSales
0          3  Alice Bees       23456
1          4  Tim Horton        2512

In [119]:
pd.merge(dfEmployees, dfSales, on='employeeID', how='outer')

  employeeID        name  totalSales
0          1   Amy Jones         NaN
1          2  Allen Keys         NaN
2          3  Alice Bees     23456.0
3          4  Tim Horton      2512.0
4          5         NaN      2345.0
5          6         NaN      1455.0

In [120]:
pd.merge(dfEmployees, dfSales, on='employeeID', how='left')

  employeeID        name  totalSales
0          1   Amy Jones         NaN
1          2  Allen Keys         NaN
2          3  Alice Bees     23456.0
3          4  Tim Horton      2512.0

Specify the column name in each DF to merge on:

In [121]:
pd.merge(dfEmployees,
        dfSales,
        left_on='employeeID',
        right_on='employeeID')

  employeeID        name  totalSales
0          3  Alice Bees       23456
1          4  Tim Horton        2512

Can also replace left_on etc with left_index=True to merge on indices.